def display_info(goods, choice, warning=None):
    """
    відображення наявних та обраних товарів на екрані
    можливі різні варіанти відображення залежно від типу дисплея
    найпростіший чорно-білий текстовий варіант із 24 рядками й 80 символами в рядку
    можливі й інші варіанти як то три рядки із 40 символами, або
    повноцінний графічний кольоровий дисплей.

    :param goods: наявні товари
    :param choice: товари вибрані покупцем
    :param warning: повідомлення покупцеві (опція)
    :return: """


    return 0
